using static System.Runtime.InteropServices.JavaScript.JSType;

namespace Homework_Digits
{
    internal class Program
    {
        static void Main(string[] args)
        {
            string[,] symbols = {
                {"  ***  ", " *   * ", "*     *", "*     *", "*     *", " *   * ", "  ***  "},
                {"   *   ", " * *   ", "*  *   ", "   *   ", "   *   ", "   *   ", "  ***  "},
                {" ***** ", "*     *", "     * ", "    *  ", "  *    ", "*     *", "*******"},
                {" ***** ", "*     *", "      *", "   *** ", "      *", "*     *", " ***** "},
                {"    *  ", "  * *  ", " *  *  ", "*   *  ", "****** ", "    *  ", "   *** "},
                {"****** ", "*      ", "*      ", "****** ", "      *", "      *", "****** "},
                {" ***** ", "*      ", "*      ", "****** ", "*     *", "*     *", " ***** "},
                {"*******", "      *", "     * ", "    *  ", "   *   ", "  *    ", "  *    "},
                {" ***** ", "*     *", "*     *", " ***** ", "*     *", "*     *", " ***** "},
                {" ***** ", "*     *", "*     *", " ******", "      *", "      *", " ***** "}
            };

            string[,] digits = {
                {"  000  ", " 0   0 ", "0     0", "0     0", "0     0", " 0   0 ", "  000  "},
                {"   1   ", " 1 1   ", "1  1   ", "   1   ", "   1   ", "   1   ", "  111  "},
                {" 22222 ", "2     2", "     2 ", "    2  ", "  2    ", "2     2", "2222222"},
                {" 33333 ", "3     3", "      3", "   333 ", "      3", "3     3", " 33333 "},
                {"    4  ", "  4 4  ", " 4  4  ", "4   4  ", "444444 ", "    4  ", "   444 "},
                {"555555 ", "5      ", "5      ", "555555 ", "      5", "      5", "555555 "},
                {" 66666 ", "6      ", "6      ", "666666 ", "6     6", "6     6", " 66666 "},
                {"7777777", "      7", "     7 ", "    7  ", "   7   ", "  7    ", "  7    "},
                {" 88888 ", "8     8", "8     8", " 88888 ", "8     8", "8     8", " 88888 "},
                {" 99999 ", "9     9", "9     9", " 999999", "      9", "      9", " 99999 "}
            };

            Console.Write("Из чего будем делать большие цифры? ");
            Console.Write("Выбери 1 - Из цифр. 2 - Из символов. ");
            int choice = Convert.ToInt16(Console.ReadLine());

            if (choice != 1 && choice != 2)
            {
                Console.WriteLine("ERROR! PLEASE CHOISE 1 OR 2 ONLY!");
                return;
            }

            Console.Write("Введите число: ");
            string? number = Console.ReadLine();

            for (int i = 0; i < 7; i++)
            {
                if (number != null)
                {
                    for (int j = 0; j < number.Length; j++)
                    {
                        int digit = number[j] - '0';
                        if (choice == 1)
                        {
                            Console.Write(digits[digit, i] + " ");
                        }
                        else if (choice == 2)
                        {
                            Console.Write(symbols[digit, i] + " ");
                        }
                    }
                    Console.WriteLine();
                }
            }
        }
    }
}
